from datetime import datetime
import json

# Создание списка из элеменнов базы, отобранных по тэгам
def Suggest(tags):
    with open('baze.txt') as file:
        baze = json.load(file)
    bazeList = [key for (key, value) in baze.items()]
    suggestionList = ''
    for item in bazeList:
        for tag in tags:
            if tag in item:
                suggestionList += item + "; "
    return suggestionList

# Определяем текущий месяц
currentMonth = datetime.now().month
monthList = (' ', 'январь', 'февраль', 'март', 'апрель', 'май', 'июнь',
            'июль', 'август', 'сентябрь', 'октябрь', 'ноябрь', 'декабрь')

# Если осень
if currentMonth >= 9 and  currentMonth <= 11:
    tagList = ['осень', 'осенний', 'Осенний', 'осеннее', 'Осеннее', 'осенние', 'Осенние',
                'осенняя', 'сентябрь', 'октябрь', 'ноябрь', 'сентября', 'октября',
                'ноября', 'сентябрьский', 'октябрьский', 'ноябрьский', 'Сентябрьский',
                'Октябрьский', 'Ноябрьский', 'свитер', 'Листопад', 'листопад', 'Осень',
                'Осенняя' ]
    suggestionList = Suggest(tagList)
    if suggestionList == '':
        suggestionList = "добавить в ваши рецепты что-то осенее;)"
    print(f"""
_________________¶
________________¶¶
___________¶___¶¶¶___¶
___________¶¶¶¶¶¶¶¶/¶¶
____¶_______¶¶¶¶|¶¶/¶¶________¶
_¶¶¶¶¶¶______¶¶¶|¶/¶¶_______¶¶¶¶¶
__¶¶¶¶¶¶____¶¶¶¶|/¶¶¶____¶¶¶¶¶¶
_¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶|¶¶¶/¶¶¶¶¶/¶¶¶¶¶¶
____¶¶¶¶¶¶¶¶¶¶¶¶|¶¶/¶¶¶¶¶/¶¶¶¶
¶____¶¶¶¶¶¶¶¶¶¶¶|¶/¶¶¶¶¶/¶¶¶_____¶
¶¶¶_¶¶¶¶¶¶¶¶¶¶¶¶|/¶¶¶¶¶/¶¶¶¶__¶¶¶¶
¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶|¶¶¶¶¶/¶¶¶¶¶¶¶¶¶¶¶
__¶¶¶¶¶¶¶¶¶¶¶¶¶¶|¶¶¶¶/¶¶¶¶¶/¶¶¶¶
___¶¶¶¶¶¶¶¶¶¶¶¶¶|¶¶¶/¶¶¶¶/¶¶¶¶¶
_¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶|¶¶/¶¶¶/¶¶¶¶¶¶¶¶¶¶
________¶¶¶¶¶¶¶¶|¶/¶/¶¶¶¶¶¶
_______________¶¶
______________¶¶      На дворе {monthList[currentMonth]}, осень.
______________¶¶     самое время приготовить что-то уютное,
______________¶¶     бодрящее из ваших рецептов.
_______________¶¶     Рекомендуем:
________________¶¶¶     {suggestionList}
    """)

 # Если зима
elif currentMonth == 12 or currentMonth == 1 or currentMonth == 2:
    tagList = ['зима', 'зимний', 'Зимний', 'зимнее', 'Зимнее', 'зимние', 'Зимние',
                'зимняя', 'январь', 'декабрь', 'февраль', 'декабря', 'января',
                'февраля', 'декабрьский', 'январский', 'февральский', 'Декабрьский',
                'Январский', 'Февральский', 'свитер', 'снег', 'Снег', 'снегопад',
                'Снегопад', 'Иней', 'иней', 'Зима', 'Зимняя', 'зимушка', 'Зимушка',
                'новый год', 'Новый год', 'новым годом', 'Новым годом']
    suggestionList = Suggest(tagList)
    if suggestionList == '':
        suggestionList = "добавить в ваши рецепты что-то зимнее;)"
    print(f"""
_____________________$$
_____________________$$
_____________$$$$____$$____$$$$
_____ ____$$____$$$$$$$$$$$$$$____$$
_________$$________$$$$$$________$$
_$$______$$__________$$__________$$______$$
_$$$$$$__$ $__________$$__________$$__$$$$$$
_____$$$$$$__________$$__________$$$$$$
_______$$$$$$________$$________$$$$$$
___$$$$______$$ $$____$$____$$$$______$$$$
_$$______________$$$$$$$$$$______________$$
___________________$$$$$$
_$$______________$$$ $$$$$$$______________$$
___$$$$______$$$$____$$____$$$$______$$$$
_______$$$$$$________$$________$$$$$$
_____$$$$$$__________$$__ ________$$$$$$
_$$$$$$__$$__________$$__________$$__$$$$$$
_$$______$$__________$$__________$$______$$
_________$$________$$$$$$_____ ___$$
_________$$____$$$$$$$$$$$$$$____$$   На дворе {monthList[currentMonth]}, зима.
_____________$$$$____$$____$$$$       самое время приготовить что-то приятное,
_____________________$$               согревающее из ваших рецептов.
___________
                Рекомендуем:
{suggestionList}
    """)
