#!/usr/bin/env python3
"""Russian localisation."""

MAIN_MENY = """
                    ГЛАВНОЕ МЕНЮ
****************************************************
    [С] Cоздать новый рецепт
    [П] Показать все рецепты
    [В] Показать рецепты с маслами из коллекции
    [У] Удалить рецепт
    [К] Показать мою коллекцию масел
    [Р] Поставить рейтинг рецепту
    [А] Показать сезонные рецепты
    [З] Завершить программу
****************************************************
                                        EOR ver.1.13
    """
MINI_MAIN = """\
****************************************************
[С]-нов.рецепт [П]-все рецепты [В]-возможные рецепты
[У]-уд. рецепт [К]-моя коллекц.[Р]-поставить рейтинг
[А]-показать сезонные рецепты  [З]-завершить прогр.
"""
COLLECTION_MENY = """
                    МЕНЮ КОЛЛЕКЦИИ
----------------------------------------------------
    [Д] Добавить масло в коллекцию
    [У] Удалить масло из коллекции
    [Н] Найти все рецепты с заданным маслом
    [О] Показать лист отсутсвующих масел
    [М] Вернуться в основное меню программы
    [К] Показать мою коллекцию масел
    [З] Завершить программу
----------------------------------------------------
"""
MINI_COLLECTION = """
----------------------------------------------------
[Д]-добав.масло [У]-удл.масло [Н]-найти рецепты
[О]-отсут.ингр. [М]-меню      [К]-показать колекцию
[З]-завершить прогр.
"""
