from datetime import datetime
import json

# Создание списка из элеменнов базы, отобранных по тэгам
def Suggest(tags):
    with open('data/baze.txt') as file:
        baze = json.load(file)
    bazeList = [key.lower() for (key, value) in baze.items()]
    suggestionList = ''
    for item in bazeList:
        for tag in tags:
            if tag in item:
                suggestionList += item + "; "
    return suggestionList

# Определяем текущий месяц
currentMonth = datetime.now().month
monthList = (' ', 'январь', 'февраль', 'март', 'апрель', 'май', 'июнь',
            'июль', 'август', 'сентябрь', 'октябрь', 'ноябрь', 'декабрь')

# Если осень
if currentMonth >= 9 and  currentMonth <= 11:
    tagList = ['осень', 'осенний', 'осеннее', 'осенние', 'осенняя', 'сентябрь',
               'октябрь', 'ноябрь', 'сентября', 'октября', 'ноября',
               'сентябрьский', 'октябрьский', 'ноябрьский', 'свитер', 'листопад']
    suggestionList = Suggest(tagList)
    if suggestionList == '':
        suggestionList = "добавить в ваши рецепты что-то осенее;)"
    print(f"""
_________________¶
________________¶¶
___________¶___¶¶¶___¶
___________¶¶¶¶¶¶¶¶/¶¶
____¶_______¶¶¶¶|¶¶/¶¶________¶
_¶¶¶¶¶¶______¶¶¶|¶/¶¶_______¶¶¶¶¶
__¶¶¶¶¶¶____¶¶¶¶|/¶¶¶____¶¶¶¶¶¶
_¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶|¶¶¶/¶¶¶¶¶/¶¶¶¶¶¶
____¶¶¶¶¶¶¶¶¶¶¶¶|¶¶/¶¶¶¶¶/¶¶¶¶
¶____¶¶¶¶¶¶¶¶¶¶¶|¶/¶¶¶¶¶/¶¶¶_____¶
¶¶¶_¶¶¶¶¶¶¶¶¶¶¶¶|/¶¶¶¶¶/¶¶¶¶__¶¶¶¶
¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶|¶¶¶¶¶/¶¶¶¶¶¶¶¶¶¶¶
__¶¶¶¶¶¶¶¶¶¶¶¶¶¶|¶¶¶¶/¶¶¶¶¶/¶¶¶¶
___¶¶¶¶¶¶¶¶¶¶¶¶¶|¶¶¶/¶¶¶¶/¶¶¶¶¶
_¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶|¶¶/¶¶¶/¶¶¶¶¶¶¶¶¶¶
________¶¶¶¶¶¶¶¶|¶/¶/¶¶¶¶¶¶
_______________¶¶
______________¶¶      На дворе {monthList[currentMonth]}, осень.
______________¶¶     самое время приготовить что-то уютное,
______________¶¶     бодрящее из ваших рецептов.
_______________¶¶     Рекомендуем:
________________¶¶¶     {suggestionList}
    """)

 # Если зима
elif currentMonth == 12 or currentMonth == 1 or currentMonth == 2:
    tagList = ['зима', 'зимний', 'зимнее', 'зимние',
                'зимняя', 'январь', 'декабрь', 'февраль', 'декабря', 'января',
                'февраля', 'декабрьский', 'январский', 'февральский', 'свитер',
                'снег', 'снегопад', 'иней', 'зимушка', 'Зимушка',
                'новый год', 'новым годом', 'рождество', 'рождественский']
    suggestionList = Suggest(tagList)
    if suggestionList == '':
        suggestionList = "добавить в ваши рецепты что-то зимнее;)"
    print(f"""
_____________________$$
_____________________$$
_____________$$$$____$$____$$$$
_____ ____$$____$$$$$$$$$$$$$$____$$
_________$$________$$$$$$________$$
_$$______$$__________$$__________$$______$$
_$$$$$$__$ $__________$$__________$$__$$$$$$
_____$$$$$$__________$$__________$$$$$$
_______$$$$$$________$$________$$$$$$
___$$$$______$$ $$____$$____$$$$______$$$$
_$$______________$$$$$$$$$$______________$$
___________________$$$$$$
_$$______________$$$ $$$$$$$______________$$
___$$$$______$$$$____$$____$$$$______$$$$
_______$$$$$$________$$________$$$$$$
_____$$$$$$__________$$__ ________$$$$$$
_$$$$$$__$$__________$$__________$$__$$$$$$
_$$______$$__________$$__________$$______$$
_________$$________$$$$$$_____ ___$$
_________$$____$$$$$$$$$$$$$$____$$   На дворе {monthList[currentMonth]}, зима.
_____________$$$$____$$____$$$$       самое время приготовить что-то приятное,
_____________________$$               согревающее из ваших рецептов.
___________
                Рекомендуем:
{suggestionList}
    """)

# Если весна
elif currentMonth >= 3 and  currentMonth <= 5:
   tagList = ['весна', 'весенний', 'весеннее', 'весенние',
               'весенняя', 'март', 'апрель', 'май', 'марта', 'апреля',
               'мая', 'мартовский', 'апрельский', 'майский', 'свежий']
   suggestionList = Suggest(tagList)
   if suggestionList == '':
       suggestionList = "добавить в ваши рецепты что-то весеннее;)"
   print(f"""
______d$$$$b_d$$$$$b
_____$$$$$$$$$$$$$$$$$
____$$$$$$P_$$$$$$$$$
_____V$P_______Y$$P
___________________d$$b
___$$$$_________$$$$$$
___$$$ $$$______$$$$$$$
____Y$$$$$$$$$$$$$$$$P
______Y$P_$$$$$$$
__________Y$$$P_$
__________________$
_________________$
_________________ $
__________________$$$$$_
_________________$$$$$$$$ $
__$$$$$$$_______$$$$$$
_$$$$$$$$$__$$$$$       На дворе {monthList[currentMonth]}, весна.
$_ _____$$$$$       Самое время бодрящих, легкий ароматов!
________$$_$       Рекомендуем:
_________$$$    {suggestionList}
__________$$
___________$
   """)

# Если лето
elif currentMonth >= 6 and  currentMonth <= 8:
  tagList = ['лето', 'летний', 'летнее', 'летние',
              'летняя', 'июнь', 'июль', 'август', 'июля', 'июня',
              'августа', 'июньский', 'июльский', 'августовский', 'тропический',
              'тропики', 'экзотика', 'экзотический', 'отпуск']
  suggestionList = Suggest(tagList)
  if suggestionList == '':
      suggestionList = "добавить в ваши рецепты что-то летнее;)"
  print(f"""
________________ ¶¶¶¶¶¶¶¶
_______________ ¶¶¶¶
___¶¶¶¶¶¶¶¶¶__ ¶¶¶____¶¶¶
_ ¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶
¶¶¶¶¶ ______¶¶¶¶¶¶¶¶____¶¶¶¶¶
_______ ¶¶¶¶¶¶¶¶¶¶¶¶¶¶¶_____¶¶
______ ¶¶¶¶__¶¶¶_¶¶¶¶¶¶¶¶¶
____ ¶¶¶¶___¶¶¶___¶¶¶_¶¶¶¶¶
___ ¶¶¶¶¶__¶¶¶¶_¶¶_¶¶¶_¶¶¶¶¶
___ ¶¶¶___¶¶¶¶¶_¶¶__¶¶¶__¶¶¶
__ ¶¶____¶¶¶¶¶___¶¶_¶¶¶¶_¶¶¶
________ ¶¶¶_____¶¶___¶¶__¶
_________ ¶¶¶____¶¶¶__¶¶__¶
_________ ¶¶¶_____¶¶___¶
_________ ¶¶______¶¶
_________________ ¶¶¶
_________________ ¶¶¶       На дворе {monthList[currentMonth]}, лето.
_________________ ¶¶¶      Самое время экзотических коктейлей и
________________ ¶¶¶¶      сладости фруктов!
________________ ¶¶¶       Рекомендуем:
____________ ¶¶¶_¶¶¶      {suggestionList}
______________ ¶¶¶¶¶¶¶¶

  """)
